app/controllers/articles_controller.rb

  def new
    @article = Article.new
    @allarticles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    # @article = Article.new(title: "...", body: "...")
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "city") VALUES (?, ?, ?, ?, ?)  [["title", "Piunith 3"], ["body", "{unith 33 asdjnaskjdn"], ["created_at", "2022-07-14 15:35:43.045542"], ["updated_at", "2022-07-14 15:35:43.045542"], ["city", nil]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "city" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-07-14 15:38:34.958348"], ["city", "testing city"], ["id", 4]]